XMLInputData/CreateEmployerEndpoint.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sch="http://www.sonatacentral.com/service/v30/common/scheme" xmlns:ser="http://www.sonatacentral.com/service/v30/Service" xmlns:cal="http://www.sonatacentral.com/service/v30/CallerDetails" xmlns:iden="http://www.sonatacentral.com/service/v30/globaltypes/IdentifierType" xmlns:cli="http://www.sonatacentral.com/service/v30/globaltypes/common/client/ClientGroupType" xmlns:dat="http://www.sonatacentral.com/service/v30/globaltypes/common/data/DataGroupType" xmlns:mod="http://www.sonatacentral.com/service/v30/globaltypes/common/Model" xmlns:sch1="http://www.sonatacentral.com/service/v30/globaltypes/common/scheme/SchemeGroupType" xmlns:prod="http://www.sonatacentral.com/service/v30/globaltypes/wrap/product/ProductGroupType" xmlns:pol="http://www.sonatacentral.com/service/v30/globaltypes/life/policy/PolicyGroupType" xmlns:acc="http://www.sonatacentral.com/service/v30/globaltypes/wrap/account/AccountGroupType">
   <soapenv:Header/>
   <soapenv:Body>
      <sch:createEmployerRequest>
         <ser:CallerDetails>
            <cal:username>demo</cal:username>
            <cal:country>ZA</cal:country>
            <cal:language>EN</cal:language>
            <cal:databaseIdentifier>SonataDatasourceDev</cal:databaseIdentifier>
         </ser:CallerDetails>
         <sch:clientIdentifier>
            <sch:existing>
               <iden:id>sClientPaypointID</iden:id>
            </sch:existing>
         </sch:clientIdentifier>
         <sch:employerDetails>
            <sch1:typeCode>
               <dat:code>PAYP</dat:code>
               <dat:codeType>SCLT</dat:codeType>
            </sch1:typeCode>
            <sch1:name>sClientPaypoint</sch1:name>
            <sch1:shortName>Five Co456</sch1:shortName>
            <sch1:scheme>
               <sch1:schemeNumber>DS1</sch1:schemeNumber>
            </sch1:scheme>
            <sch1:categoryRules>
               <sch1:longName>Structure 1 GR</sch1:longName>
               <sch1:isUsed>true</sch1:isUsed>
               <sch1:category>
                  <dat:shortName>Structure 1 GR</dat:shortName>
               </sch1:category>
            </sch1:categoryRules>
            <sch1:productRules>
               <sch1:product>
                  <prod:shortName>Umbrella Pens</prod:shortName>
               </sch1:product>
               <sch1:category>
                  <dat:shortName>Structure 1 GR</dat:shortName>
               </sch1:category>
               <sch1:participatingFlag>true</sch1:participatingFlag>
               <sch1:insuranceProductRule>
                  <sch1:effectiveDate>2018-07-01T00:00:00.000</sch1:effectiveDate>
                  <sch1:status>
                     <dat:code>ACTV</dat:code>
                     <dat:codeType>EINS</dat:codeType>
                  </sch1:status>
                  <sch1:insuranceProductRule>
                     <sch1:benefitTemplate>
                        <pol:benefitTemplate>
                           <iden:name>2.1 Ext App&lt;FCL</iden:name>
                        </pol:benefitTemplate>
                     </sch1:benefitTemplate>
                     <sch1:statusDate>2018-07-01T00:00:00.000</sch1:statusDate>
                     <sch1:defaultBenefit>true</sch1:defaultBenefit>
                     <sch1:available>true</sch1:available>
                     <sch1:employerCatRider>
                        <sch1:riderTemplate>
                           <pol:shortName>ACD Ext &lt;FCL</pol:shortName>
                        </sch1:riderTemplate>
                        <sch1:available>true</sch1:available>
                        <sch1:defaultRider>true</sch1:defaultRider>
                        <sch1:parameterType>
                           <sch1:name>ACDEX&lt;FCL EXIN</sch1:name>
                           <sch1:value>ABSA</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL LSBC</sch1:name>
                           <sch1:value>MULT</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL BENS</sch1:name>
                           <sch1:value>PENS</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL BILL</sch1:name>
                           <sch1:value>PERC</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL PRSL</sch1:name>
                           <sch1:value>PENS</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL BENM</sch1:name>
                           <sch1:value>6</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                        <sch1:parameterType>
                           <sch1:name>ACDEX &lt;FCL RSKR</sch1:name>
                           <sch1:value>0.35</sch1:value>
                           <sch1:applyTo>
                              <dat:code>NEWP</dat:code>
                              <dat:codeType>RDRP</dat:codeType>
                           </sch1:applyTo>
                        </sch1:parameterType>
                     </sch1:employerCatRider>
                  </sch1:insuranceProductRule>
               </sch1:insuranceProductRule>
            </sch1:productRules>
            <sch1:productRules>
               <sch1:product>
                  <prod:shortName>Umbrella Prov</prod:shortName>
               </sch1:product>
            </sch1:productRules>
            <sch1:locationHierarchy>
               <iden:name>sClientHeadoffice</iden:name>
               <sch1:parentLocationIdentifier>
                  <iden:id>sClientID</iden:id>
                  <iden:name>sClientHeadoffice2</iden:name>
               </sch1:parentLocationIdentifier>
            </sch1:locationHierarchy>
            <sch1:reportingNode>false</sch1:reportingNode>
         </sch:employerDetails>
         <sch:expenseOverride>
            <sch1:expenseGroup>
               <iden:id>42000029</iden:id>
               <iden:name>Umbrella</iden:name>
            </sch1:expenseGroup>
            <sch1:effectiveDate>2018-07-01T00:00:00.000</sch1:effectiveDate>
            <sch1:expenseGroupLine>
               <dat:override>true</dat:override>
               <dat:expCalcBasis>
                  <iden:id>42000457</iden:id>
                  <iden:name>Cons Fee Contrb</iden:name>
                  <dat:excbDescription>Umbrella Pens, Inclusive Admin Fee Debit on Cont Sched Inv alloc to Inclusive as % of Salary</dat:excbDescription>
               </dat:expCalcBasis>
               <dat:parameter>
                  <dat:percentage>0.75</dat:percentage>
               </dat:parameter>
            </sch1:expenseGroupLine>
            <sch1:expenseGroupLine>
               <dat:override>true</dat:override>
               <dat:expCalcBasis>
                  <dat:excbDescription>Umbrella Pens, Exclusive Cons Fee Contrb on Cont Sched Inv alloc to Cont Fee Deduct Exclusive Group as Straight % of Monthly Salary</dat:excbDescription>
               </dat:expCalcBasis>
               <dat:parameter>
                  <dat:percentage>0.25</dat:percentage>
               </dat:parameter>
            </sch1:expenseGroupLine>
            <sch1:expenseGroupLine>
               <dat:override>true</dat:override>
               <dat:expCalcBasis>
                  <dat:excbDescription>Umbrella Prov, Inclusive Admin Fee Debit on Cont Sched Inv alloc to Inclusive as % of Salary</dat:excbDescription>
               </dat:expCalcBasis>
               <dat:parameter>
                  <dat:percentage>0.25</dat:percentage>
               </dat:parameter>
            </sch1:expenseGroupLine>
            <sch1:expenseGroupLine>
               <dat:override>true</dat:override>
               <dat:expCalcBasis>
                  <dat:excbDescription>Umbrella Prov, Exclusive Cons Fee Contrb on Cont Sched Inv alloc to Cont Fee Deduct Exclusive Group as Straight % of Monthly Salary</dat:excbDescription>
               </dat:expCalcBasis>
               <dat:parameter>
                  <dat:percentage>0.25</dat:percentage>
               </dat:parameter>
            </sch1:expenseGroupLine>
         </sch:expenseOverride>
      </sch:createEmployerRequest>
   </soapenv:Body>
</soapenv:Envelope>